using System;
using System.Collections;
using System.Collections.Generic;
using System.Linq;
using System.Reflection.Emit;
using System.Text;
using System.Threading.Tasks;

namespace SVINspace
{
    public class YoshkinCode : Trophy
    {
        public YoshkinCode()
        {
            Name = "Йошкин код";
            Description = "Давным-давно, когда мир ещё только зарождался из бесконечного вороха идей, \nи по тверди его земной ещё не до конца можно было " +
                "\nходить, не проваливаясь вниз, когда демиурги ещё не были \nжадными и тупыми скотинами, был кот. Кот как кот, если не знать, " +
                "\nчто изначально его быть не должно было. А появился он из-за ошибки в коде. \nКогда же один из демиургов увидел его, он воскликнул: " +
                "\n«Да ёшкин кот! Полстраницы кода впустую! ГАП, ты куда смотришь?». \nЭто высказывание услышал один герой, проходивший мимо, " +
                "\nи распространил об этом высказывании весть по всей своей родной деревне, \nкоторой сейчас нет. Но из-за искажения слова мозгом героя, " +
                "\nа также из-за проблем с его памятью, загадочный кот превратился в йошкиного кода. \nНо годы идут, времена меняются. И в один из дней " +
                "\n йошкин код вдруг заметил (Или не он, а проходивший мимо герой, говорят, \nчто тот кот замечал туговато), что вдруг хвост у него " +
                "\nкуда-то исчез. Потом также исчезли лапы, туловище, и даже голова. \nИ йошкин кот исчез сам. Но через несколько дней " +
                "\nна различных поверхностях, но чаще всего на секретной бумаге демиургов, \nначали проступать различные зелёные цифры не имеющие " +
                "\nничего общего между собой. После долгих мутаций и воздействий \nпервозданной праны, на листах, стенах, плитах и шкурах монстров " +
                "\nцифры начали оживать и двигаться поближе к другим участкам кода. \nПозже, когда большая часть цифр и букв объединилась с собратьями, " +
                "\nостались только какие-то безобразные кляксы, что никто \nдаже не хотел смотреть в сторону этих надписей. Начались продолжительные поиски " +
                "\nболее приятной формы бытия, и, проведя социологический опрос населения, \nсошлись на форме кота. После чего части кода начали " +
                "\nимитировать жизнь котов, но из-за недостатка третьего пространства, \nэто не очень у них получалось. Однажды, увидев как один герой " +
                "\nскладывает трофеи вместе, йошкин коды решили через боль и страдания \nпреобразоваться в настоящего кота, что им вероятно удалось. ";
            Price = 700;
            RareLevel = Rareness.Эпическая;

        }
    }
}
